
///////////////////////////////////////////////////////////////////////////////////////////////////
// Прикладной интерфейс

Перем Лог;

Процедура ЗарегистрироватьКоманду(Знач ИмяКоманды, Знач Парсер) Экспорт
	
	ОписаниеКоманды = Парсер.ОписаниеКоманды(ИмяКоманды, "Получить файл из Yandex-Диск");

	Парсер.ДобавитьПозиционныйПараметрКоманды(ОписаниеКоманды, "ПутьКФайлу", "Путь к локальному файлу для сохранения");

	Парсер.ДобавитьИменованныйПараметрКоманды(ОписаниеКоманды, 
		"-ya-token",
		"Token авторизации");

	Парсер.ДобавитьИменованныйПараметрКоманды(ОписаниеКоманды, 
		"-ya-path",
		"Путь к файлу на Yandex-Диск");

	Парсер.ДобавитьПараметрФлагКоманды(ОписаниеКоманды,
		"-use-source-as-split",
		"Использовать файл как список файлов для закачки");

	Парсер.ДобавитьПараметрФлагКоманды(ОписаниеКоманды, 
		"-delsource",
		"Удалить файл после получения");

	Парсер.ДобавитьКоманду(ОписаниеКоманды);
	
КонецПроцедуры

Функция ВыполнитьКоманду(Знач ПараметрыКоманды) Экспорт
    
	ЦелевойПуть				= ПараметрыКоманды["ПутьКФайлу"];
	OAuth_Токен				= ПараметрыКоманды["-ya-token"];
	ПутьНаДиске				= ПараметрыКоманды["-ya-path"];
	УдалитьИсточник			= ПараметрыКоманды["-delsource"];
	ЭтоСписокФайлов			= ПараметрыКоманды["-use-source-as-split"];

	ВозможныйРезультат = МенеджерКомандПриложения.РезультатыКоманд();

	Если ПустаяСтрока(ЦелевойПуть) Тогда
		Лог.Ошибка("Не указана путь к файлу для сохранения");
		Возврат ВозможныйРезультат.НеверныеПараметры;
	КонецЕсли;

	Если ПустаяСтрока(OAuth_Токен) Тогда
		Лог.Ошибка("Не задан Token авторизации");
		Возврат ВозможныйРезультат.НеверныеПараметры;
	КонецЕсли;

	Если ПустаяСтрока(ПутьНаДиске) Тогда
		Лог.Ошибка("Не задан путь к файлу для получения из Yandex-Диск");
		Возврат ВозможныйРезультат.НеверныеПараметры;
	КонецЕсли;

	Попытка
		ЯндексДиск = Новый ЯндексДиск;
		ЯндексДиск.УстановитьТокенАвторизации(OAuth_Токен);

		ЗаписьТекста = Новый ЗаписьТекста(ЦелевойПуть);
		ЗаписьТекста.Закрыть();

		ПутьКСкачанномуФайлу = ЯндексДиск.СкачатьФайлСДиска(ЦелевойПуть, ПутьНаДиске, Истина);

		Лог.Информация(СтрШаблон("Загружен файл %1", ПутьКСкачанномуФайлу));

		Если УдалитьИсточник Тогда
			ЯндексДиск.Удалить(ПутьНаДиске, Истина);
			СвойстваДиска = ЯндексДиск.ПолучитьСвойстваДиска();
			Лог.Информация("Удален файл на Yandex-Диск %1", ПутьНаДиске);
			Лог.Информация("Всего доступно %1 байт", СвойстваДиска.total_space);
			Лог.Информация("Из них занято %1 байт", СвойстваДиска.used_space);
		КонецЕсли;
		
		Возврат ВозможныйРезультат.Успех;
	Исключение
		Лог.Ошибка(ОписаниеОшибки());
		Возврат ВозможныйРезультат.ОшибкаВремениВыполнения;
	КонецПопытки;

КонецФункции

// Получение файла с Яндекс-диска
//
// Параметры:
//  ЯДиск  		- <ЯндексДиск> - <описание параметра>
//                 
//  ИмяФайла  	- <Строка> - имя скачиваемого файла
//	ЦелевойПуть	- <Строка> - каталог, куда будет скачиваться файл
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьФайлСЯдиска(ЯДиск = Неопределено, Знач ИмяФайла, Знач ЦелевойПуть)
	Если ЯДиск = Неопределено Тогда
		ЯДиск = Новый ЯндексДиск;
		ЯДиск.УстановитьТокенАвторизации(OAuth_Токен);
	КонецЕсли;
КонецФункции // ИмяФункции()

Лог = Логирование.ПолучитьЛог("ktb.app.copydb");